KPPHC/iot-portfolio/Module04/sketch_march24_task6-esp8266.cpp
#include <ESP8266WiFi.h>
#include <ESP8266mDNS.h>
#include <WiFiUdp.h>
#include <ArduinoOTA.h>

#ifndef STASSID
#define STASSID "IOT14"
#define STAPSK "iotempire"
#endif

const char* ssid = STASSID;
const char* password = STAPSK;
const int ledPin = D2;

bool flashing = true;
unsigned long startTime = 0;


void setup() {
  Serial.begin(115200);
  Serial.println("Booting");
  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid, password);
  while (WiFi.waitForConnectResult() != WL_CONNECTED) {
    Serial.println("Connection Failed! Rebooting...");
    delay(5000);
    ESP.restart();
  }

  // Port defaults to 8266
  ArduinoOTA.setPort(8266);

  // Hostname defaults to esp8266-[ChipID]
  // the ip of the microcontroller is 192.168.14.182
  const char* hostname = "my-esp8266";
  WiFi.setHostname(hostname);
  ArduinoOTA.setHostname(hostname);

  // No authentication by default
  ArduinoOTA.setPassword("iotempower");

  // Password can be set with it's md5 value as well
  // MD5(admin) = 21232f297a57a5a743894a0e4a801fc3
  // ArduinoOTA.setPasswordHash("21232f297a57a5a743894a0e4a801fc3");

  ArduinoOTA.onStart([]() {
    String type;
    if (ArduinoOTA.getCommand() == U_FLASH) {
      type = "sketch";
    } else {  // U_FS
      type = "filesystem";
    }

    // NOTE: if updating FS this would be the place to unmount FS using FS.end()
    Serial.println("Start updating " + type);
  });
  ArduinoOTA.onEnd([]() {
    Serial.println("\nEnd");
  });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    Serial.printf("Progress: %u%%\r", (progress / (total / 100)));
  });
  ArduinoOTA.onError([](ota_error_t error) {
    Serial.printf("Error[%u]: ", error);
    if (error == OTA_AUTH_ERROR) {
      Serial.println("Auth Failed");
    } else if (error == OTA_BEGIN_ERROR) {
      Serial.println("Begin Failed");
    } else if (error == OTA_CONNECT_ERROR) {
      Serial.println("Connect Failed");
    } else if (error == OTA_RECEIVE_ERROR) {
      Serial.println("Receive Failed");
    } else if (error == OTA_END_ERROR) {
      Serial.println("End Failed");
    }
  });
  ArduinoOTA.begin();
  Serial.println("Ready");
  Serial.print("IP address: ");
  Serial.println(WiFi.localIP());
}

void callback(char* topic, byte* payload, unsigned int length) {
 String message;
 for (unsigned int i = 0; i < length; i++) {
   message += (char)payload[i];
 }


 if (String(topic) == "alarm") {
   if (message == "on") {
     flashing = true;
     startTime = millis();
   } else if (message == "off") {
     flashing = false;
     analogWrite(ledPin, 0); // Turn off LED
   }
 }
}
 

void loop() {
  ArduinoOTA.handle();
  //Serial.println("OTA Update Successful!");
  //delay(100);
  // Non-blocking print instead of delay()
  static unsigned long lastUpdate = 0;
  unsigned long currentTime = millis();

  if (currentTime - lastUpdate > 2000) {
    lastUpdate = millis();
    Serial.println("Waiting for OTA...");
  }

  if (flashing) {
   
   if (currentTime - startTime < 30000) { // 30 seconds
     int brightness = (sin((currentTime - startTime) / 1000.0 * PI) * 127.5) + 127.5;
     analogWrite(ledPin, brightness);
   } else {
     flashing = false;
     analogWrite(ledPin, 0); // Turn off LED
   }
 }
}
